package com.example.newsapplication.Models;

public class ModelofDetails {


    /**
     * post_id : 7
     * post_title : وزير الثقافة الأسبق غاضباً: الورقي "كلام فاضي".. و"التنمية المستدامة"  تحتاج لـ"التخطيط"
     * post_img : https://cizaro.net/2030/uploads/blog/posts/post-15590033325cec80c4c502f.jpg
     * short_description : يرفض الدكتور عماد أبو غازي وزير الثقافة الأسبق تعبير "هيبة" الكتاب الورقي الذي أطلقه بعض النخبة والمثقفين، مؤكداً في حواره مع "2030" على ضرورة التركيز فقط على المضمون الذي يقدمه الكتاب
     * long_description : يرفض الدكتور عماد أبو غازي وزير الثقافة الأسبق تعبير &quot;هيبة&quot; الكتاب الورقي الذي أطلقه بعض النخبة والمثقفين، مؤكداً في حواره مع &quot;2030&quot; على ضرورة التركيز فقط على المضمون الذي يقدمه الكتاب.

     ويستفيض أبو غازي -غاضباً- في رفضه هذا التعبير، بوصفه &quot;كلام فاضي&quot;، ونوع من &quot;العته&quot;، وأن احتمالية انقراض &quot;الورقي&quot; في السنوات القادمة واردة.
     &nbsp;

     عماد أبو غازي الذي حمل حقيبة وزارة الثقافة في حكومة عصام شرف الشهيرة، انتقل في حديثه إلى برنامج التنمية المستدامة، وآلية تنفيذه، ومتابعة ذلك من قبل وزارة التخطيط، فإلى نص الحوار:
     &nbsp;

     &nbsp;


     لماذا نقرأ؟
     &nbsp;


     &quot;بشكل عام، نقرأ من أجل تحقيق المتعة الشخصية، واكتساب المعرفة، وتختلف أهداف القراءة من فرد لآخر، سواء كانت القراءة لأعمال أدبية، أو إبداعية، أو دراسات وبحوث، ولكن في النهاية، يجب ألا يبتعد الهدف عن المتعة والمعرفة&quot;.
     &nbsp;

     &nbsp;


     من وجهة نظرك، هل تراجعت حقاً معدلات القراءة لدى الشباب؟ &nbsp;


     &nbsp;

     &nbsp;&quot; لا نستطيع أن نحكم في ذلك، وعلى الرغم من غياب الدراسات الدقيقة التي تحدد معدلات القراءة لدى الشباب، إلا أن المشاهد التي نراها في الأجيال الجديدة تؤكد هذا التراجع، ولكن كل هذا لا يخرج عن كونه كلام انطباعي، لا يخضع للدراسات الدقيقة والواضحة&quot;.

     &nbsp;

     &nbsp;


     ماذا عن العلاقة بين الكتاب الورقي وبديله الإلكتروني؟



     &quot;في البداية، أرفض ارتباط القراءة بالكتاب الورقي فقط، ما يهم فعلاً هو الوصول إلى المحتوى، فـالكتاب الورقي في طريقه للإنقراض في غضون سنوات، وهذا تطور طبيعي&quot;
     &nbsp;

     &nbsp;


     كيف نعيد للكتاب الورقي هيبته؟
     &nbsp;


     &quot;التمسك بشكل الكتاب الورقي يشبه تماماً تمسك البعض بالمخطوطات، ولكننا نعيش عصر جديد بأدوات مختلفة، فلا هيبة للكتاب، وهل يعني هذا التعبير أنه &quot;لابس بدلة وطربوش؟&quot; هذا كلام غير منطقي&quot;.
     &nbsp;

     &nbsp;


     قدم للقارئ &quot;روشتة&quot; لعلاج قلة الإقبال على القراءة.
     &nbsp;


     &quot;لست طبيباً لأقدم روشتة، أو أسدي نصائح، ومازلت أتعلم وأتفاعل مع المجتمع من حولي، ومثلما تعلمت من أساتذتي، أتعلم من تلاميذي الذين لا تتخطى أعمارهم 18 عاماً، وكل جيل له ثقافته التي يكتسبها من المعايشة، وليس من خلال النصائح والروشتات&quot;.

     &nbsp;

     &nbsp;


     يضل البعض طريقه أثناء محاولته القراءة للمرة الأولى، هل لديك مقترحات لهم؟



     &quot;لا أستطيع أن أنصح أحد بقراءة الكتاب &quot;الفلاني&quot;، ولكن.. يحتاج المجتمع إلى أدوات تساعده على الوصول إلى المعرفة، سواء بشكل الكتاب التقليدي، أو الإلكتروني، ويجب أن تتوفر مكتبات عامة، و&quot;رقمنة&quot; للإنتاج الفكري حتى تتم اتاحته عبر الانترنت، وأن يكون هذا المحتوى ملائماً لمختلف الفئات العمرية، ولمختلف الاهتمامات، لتلبية احتياجتهم وإرضاء ميولهم في القراءة والمطالعة، ولكنني لا أستطيع أن أنصح أحد بقراءة أعمال نجيب محفوظ أو توفيق الحكيم، لأن كل القراءة صحيحة، ولا تفرق بداية عن الأخرى&quot;.

     &nbsp;


     ما الذي يحتاجه الوضع الثقافي الراهن في مصر؟



     &quot;توفير منصات تتيح المعرفة، وفتح الباب أمام الإبداع الثقافي، ونحتاج أيضاً إلى أماكن مناسبة لإقامة النشاطات الثقافية، والاستمتاع بها&quot;.

     &nbsp;

     &nbsp;


     إذاً، ما رأيك في الدور الذي تقوم به المؤسسات الثقافية في عملية دعم القراءة؟
     &nbsp;


     &quot;كل الجهات الثقافية، سواء كانت قصور أو هيئة عامة للكتاب أو مجلس أعلى للثقافة، لها اصداراتها التي تباع بأسعار معقولة، مما يساعد فى توسيع قاعدة القراء &nbsp;بالطبع&quot;.

     &quot;وأذكر جيداً التجارب الثقافية المهمة في تاريخنا الحديث، مثل مشروع الألف كتاب في الخمسينيات، ومكتبة الأسرة في التسعينيات التي تراجعت من ناحية عدد الإصدارات وحجمها&quot;.

     &quot;والتجربة الحالية، يجب أن تأخذ شكل الرقمنة المتطور، وأن الكتب التي مر على وفاة مؤلفها أكثر من 50 عاماً، يجب أن تتاح على الإنترنت مجاناً&quot;
     &nbsp;

     &nbsp;


     ما مقترحاتك لتنفيذ برنامج التنمية المستدامة في المحور الثقافي؟


     &nbsp;

     &quot;يتضمن برنامج التنمية المستدامة مشروعات وبرامج ومؤشرات قياس، وعند التركيز على محور الثقافة، يجب أن يكون هناك تصور واضح حول الغايات المطلوب تحقيقها من قبل الوزارة والمؤسسات، وتصور آخر عن الوسائل والسبل المتاحة لذلك&quot;
     &nbsp;

     &quot;وعلى الرغم من اعتزالي العمل المؤسسي، إلا أنني أفترض أن وزارة التخطيط وضعت آلية للمتابعة الدورية لعمل كل الوزارات فى كل محور من محاور البرنامج، وأعتقد أن تنفيذ المطلوب من شأنه أن يغير الواقع الثقافي، للمساعدة في تنفذ برنامج التنمية المستدامة&quot;.

     &nbsp;

     &nbsp;


     في حال أصبحت وزيراً للثقافة مرة أخرى، ما هي القرارات التي تنوي اتخاذها؟
     &nbsp;


     &quot;انتهى الحديث عن هذا الأمر، تجاوزت الستين عاماً، وخضت تجربتين في وزارتي الثقافة والإعلام، وقدمت كل ما لدي، والموجود حالياً يؤدي دوره في حدود المتاح، ويحاول إضافة الجديد وفقاً لرؤيته التي تختلف عن رؤى الآخرين بالطبع&quot;.
     * favorite : false
     */

    private int post_id;
    private String post_title;
    private String post_img;
    private String short_description;
    private String long_description;
    private String favorite;

    public int getPost_id() {
        return post_id;
    }

    public void setPost_id(int post_id) {
        this.post_id = post_id;
    }

    public String getPost_title() {
        return post_title;
    }

    public void setPost_title(String post_title) {
        this.post_title = post_title;
    }

    public String getPost_img() {
        return post_img;
    }

    public void setPost_img(String post_img) {
        this.post_img = post_img;
    }

    public String getShort_description() {
        return short_description;
    }

    public void setShort_description(String short_description) {
        this.short_description = short_description;
    }

    public String getLong_description() {
        return long_description;
    }

    public void setLong_description(String long_description) {
        this.long_description = long_description;
    }

    public String getFavorite() {
        return favorite;
    }

    public void setFavorite(String favorite) {
        this.favorite = favorite;
    }
}
